app/Controllers/Link.php

SELECT *
FROM `links`
WHERE `id_user_link` = '6'
AND `id_category_link` = '10'
AND `links`.`date_deleted_link` IS NULL
---
    public function index()
    {

        if(is_null($this->session->get('active_login')) != false) return redirect()->to('/user/login');
        if($this->session->get('selected_category'))
        {
            $id_ct =  $this->session->get('selected_category');
            $links = $this->links->where('id_user_link', $this->userLogin['id_user'])->where('id_category_link',$id_ct)->findAll();